In [3]:
import pandas as pd
import numpy as np
%matplotlib inline

In [4]:
bmd = pd.read_csv('building_metadata.csv')

In [5]:
bmd.head()

   site_id  building_id primary_use  square_feet  year_built  floor_count
0        0            0   Education         7432      2008.0          NaN
1        0            1   Education         2720      2004.0          NaN
2        0            2   Education         5376      1991.0          NaN
3        0            3   Education        23685      2002.0          NaN
4        0            4   Education       116607      1975.0          NaN

In [6]:
test_df = pd.read_csv('test.csv')

In [7]:
test_df.head()

   row_id  building_id  meter            timestamp
0       0            0      0  2017-01-01 00:00:00
1       1            1      0  2017-01-01 00:00:00
2       2            2      0  2017-01-01 00:00:00
3       3            3      0  2017-01-01 00:00:00
4       4            4      0  2017-01-01 00:00:00

In [8]:
train_df = pd.read_csv('train.csv')

In [9]:
train_df['building_id'].nunique()

1449

In [11]:
train_df = reduce_mem_usage(train_df)
test_df = reduce_mem_usage(test_df)

          building_id  meter            timestamp  meter_reading
0                   0      0  2016-01-01 00:00:00           0.00
1                   1      0  2016-01-01 00:00:00           0.00
2                   2      0  2016-01-01 00:00:00           0.00
3                   3      0  2016-01-01 00:00:00           0.00
4                   4      0  2016-01-01 00:00:00           0.00
...               ...    ...                  ...            ...
19085659          403      0  2016-12-12 01:00:00          44.35
19088023          403      0  2016-12-12 02:00:00          45.45
19090387          403      0  2016-12-12 03:00:00          44.82
19092751          403      0  2016-12-12 04:00:00          45.11
19095115          403      0  2016-12-12 05:00:00          44.73

[7245 rows x 4 columns]

In [22]:
bmd['square_feet'].argmax()

869

In [24]:
bmd.iloc[869]

site_id                                    8
building_id                              869
primary_use    Entertainment/public assembly
square_feet                           875000
year_built                               NaN
floor_count                                1
Name: 869, dtype: object

In [10]:
test_df

            row_id  building_id  meter            timestamp
0                0            0      0  2017-01-01 00:00:00
1                1            1      0  2017-01-01 00:00:00
2                2            2      0  2017-01-01 00:00:00
3                3            3      0  2017-01-01 00:00:00
4                4            4      0  2017-01-01 00:00:00
...            ...          ...    ...                  ...
41697595  41697595         1444      0  2018-05-09 07:00:00
41697596  41697596         1445      0  2018-05-09 07:00:00
41697597  41697597         1446      0  2018-05-09 07:00:00
41697598  41697598         1447      0  2018-05-09 07:00:00
41697599  41697599         1448      0  2018-05-09 07:00:00

[41697600 rows x 4 columns]